Repository: Cizzuk/CSE
Catalog: Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, ko, pt, ru, uk, zh_hans, zh_hant

source: Setup Search Engine
ar: إعداد محرك بحث
de: Suchmaschine einrichten
es: Configurar Buscador
fr: Configuration du moteur de recherche
ja: 検索エンジンを設定
ko: 검색 엔진 설정
pt: Configurar Buscador
ru: Настройка поисковой системы
uk: Налаштування пошукової системи
zh_hans: 设置搜索引擎
zh_hant: 設定搜尋引擎

source: Skip
ar: تخطي
de: Überspringen
es: Omitir
fr: Sauter
ja: スキップ
ko: 건너뛰기
pt: Pular
ru: Пропустить
uk: Пропустити
zh_hans: 跳过
zh_hant: 跳過

source: Source
ar: المصدر
de: Quellcode
es: Código fuente
fr: Code source
ja: ソースコード
ko: 소스 코드
pt: Fonte
ru: Исходный код
uk: Вихідний код
zh_hans: 源代码
zh_hant: 原始碼

source: State
ar: الحالة
de: Status
es: Estado
fr: État
ja: 状態
ko: 상태
pt: Estado
ru: Состояние
uk: Стан
zh_hans: 状态
zh_hant: 狀態

source: Support
ar: الدعم
de: Hilfe
es: Ayuda
fr: Soutien
ja: サポート
ko: 지원
pt: Suporte
ru: Помощь
uk: Підтримки
zh_hans: 应用支持
zh_hant: 應用程式支援

source: The search engine you select here can know your search queries. If you have concerns about privacy, I recommend choosing DuckDuckGo.
ar: محرك البحث الذي تحدده هنا يمكنه معرفة استفسارات البحث الخاصة بك. إذا كنت قلقًا بشأن الخصوصية، أوصي باختيار DuckDuckGo.
de: Die Suchmaschine, die Sie hier auswählen, kann Ihre Suchanfragen kennen. Wenn Sie Bedenken bezüglich des Datenschutzes haben, empfehle ich Ihnen DuckDuckGo.
es: El buscador que selecciones aquí puede conocer tus consultas de búsqueda. Si te preocupa la privacidad, te recomiendo que elijas DuckDuckGo.
fr: Le moteur de recherche que vous sélectionnez ici peut connaître vos requêtes de recherche. Si vous avez des inquiétudes concernant la confidentialité, je vous recommande de choisir DuckDuckGo.
ja: ここで選択した検索エンジンはあなたの検索内容を知ることができます。プライバシーについて懸念がある場合はDuckDuckGoを選択することを推奨します。
ko: 여기서 선택한 검색 엔진은 당신의 검색 내용을 알 수 있습니다. 프라이버시가 걱정된다면 DuckDuckGo를 선택하는 것이 좋다.
pt: O buscador que você selecionar aqui pode saber suas consultas de busca. Se você tiver preocupações sobre privacidade, recomendo escolher o DuckDuckGo.
ru: Выбранная вами поисковая система может знать ваши поисковые запросы. Если вы беспокоитесь о конфиденциальности, я рекомендую выбрать DuckDuckGo.
uk: Пошукова система, яку ви обираєте тут, може знати ваші пошукові запити. Якщо ви турбуєтеся про конфіденційність, я рекомендую вибрати DuckDuckGo.
zh_hans: 您在此选择的搜索引擎可以知道您的搜索查询。如果你担心隐私问题，我建议你选择 DuckDuckGo。
zh_hant: 您在此選擇的搜尋引擎可以知道您的搜尋查詢。如果您對隱私有所顧慮，我建議您選擇 DuckDuckGo。

source: This is typically used when a search engine requires an authentication token or special parameters. If not configured correctly, CSE may not work properly.
ar: يُستخدم هذا عادةً عندما يتطلب محرك البحث رمز توثيق أو معلمات خاصة. إذا لم يتم تكوينه بشكل صحيح، قد لا يعمل CSE بشكل صحيح.
de: Dies wird in der Regel verwendet, wenn eine Suchmaschine ein Authentifizierungs-Token oder spezielle Parameter benötigt. Wenn sie nicht korrekt konfiguriert ist, funktioniert CSE möglicherweise nicht richtig.
es: Esto se utiliza normalmente cuando un buscador requiere un token de autenticación o parámetros especiales. Si no se configura correctamente, es posible que CSE no funcione correctamente.
fr: Il est généralement utilisé lorsqu'un moteur de recherche exige un jeton d'authentification ou des paramètres spéciaux. S'il n'est pas configuré correctement, le CSE peut ne pas fonctionner correctement.
ja: この機能は通常、検索エンジンに認証トークンが必要な場合や特別なパラメータが必要な場合に使用されます。正しく設定しないと、CSEが正しく動作しなくなる可能性があります。
ko: 이 기능은 일반적으로 검색 엔진에 인증 토큰이 필요하거나 특별한 매개 변수가 필요한 경우에 사용됩니다. 올바르게 설정하지 않으면 CSE가 제대로 작동하지 않을 수 있습니다.
pt: Isso é tipicamente usado quando um buscador requer um token de autenticação ou parâmetros especiais. Se não for configurado corretamente, o CSE pode não funcionar corretamente.
ru: Обычно это используется, когда поисковая система требует токен аутентификации или специальные параметры. При неправильной настройке CSE может работать некорректно.
uk: Зазвичай це використовується, коли пошукова система вимагає маркер автентифікації або спеціальні параметри. Якщо CSE налаштовано неправильно, він може не працювати належним чином.
zh_hans: 这通常在搜索引擎需要验证令牌或特殊参数时使用。如果配置不当，CSE 可能无法正常工作。
zh_hant: 這通常用於搜尋引擎需要認證標記或特殊參數時。如果配置不正確，CSE 可能無法正常運作。

source: This keyword is already used in other
ar: هذه الكلمة المفتاحية مستخدمة بالفعل في أخرى
de: Dieses Schlüsselwort wird bereits in anderen
es: Esta palabra clave ya se usa en otros
fr: Ce mot-clé est déjà utilisé dans d'autres
ja: このキーワードはすでに使用されています
ko: 이 키워드는 이미 다른
pt: Esta palavra-chave já está em uso em outro lugar
ru: Это ключевое слово уже используется в других
uk: Це ключове слово вже використовується в інших
zh_hans: 该关键字已在其他
zh_hant: 這個關鍵字已經在其他

source: Toggle
ar: تبديل
de: schalten
es: Alternar
fr: Basculer
ja: 切り替える
ko: 토글
pt: Alternar
ru: Переключить
uk: Перемкнути
zh_hans: 开/关
zh_hant: 切換

source: Turn
ar: تعيين
de: ein/aus
es: Activar/desactivar
fr: Activer/Désactiver
ja: 変更
ko: 전환
pt: Definir
ru: Изменить
uk: Перемінити
zh_hans: 切换
zh_hant: 開/關

source: Turn Emoji Search On or Off on CSE.
ar: تشغيل إيموجي بحث تشغيل أو إيقاف على CSE.
de: Schalten Sie die Emoji-Suche auf CSE ein/aus.
es: Activar o desactivar Búsqueda emoji en el CSE.
fr: Activer ou désactiver la recherche d'Emoji sur le CSE.
ja: CSEで絵文字検索をオンまたはオフに変更します。
ko: CSE에서 이모티콘 검색을 켜거나 끕니다.
pt: Definir ou Desativar Busca Emoji no CSE.
ru: Включите или выключите Поиск эмодзи на CSE.
uk: Увімкніть або вимкніть Пошук емодзі на CSE.
zh_hans: 在 CSE 上打开或关闭表情符号搜索。
zh_hant: 在 CSE 上開啟或關閉 Emoji Search。

source: Turn Quick Search On or Off on CSE.
ar: تشغيل بحث السريع تشغيل أو إيقاف على CSE.
de: Schalten Sie die Schnellsuche auf CSE ein/aus.
es: Activar o desactivar Búsqueda rápida en el CSE.
fr: Activer ou désactiver la recherche rapide sur le CSE.
ja: CSEでクイック検索をオンまたはオフに変更します。
ko: CSE에서 빠른 검색을 켜거나 끕니다.
pt: Definir ou Desativar Busca Rápida no CSE.
ru: Включите или выключите Быстрый поиск на CSE.
uk: Увімкніть або вимкніть Швидкий пошук на CSE.
zh_hans: 在 CSE 上打开或关闭快速搜索。
zh_hant: 在 CSE 上開啟或關閉快速搜尋。

source: URL
ar: رابط

source: Use different search engine in Private Browse.
ar: استخدام محرك بحث مختلف في التصفح الخاص.
de: Andere Suchmaschine im „Privates Surfen“ verwenden.
es: Usar un buscador diferente en Navegación privada.
fr: Utiliser un moteur de recherche différent dans la Navigation privée.
ja: プライベートブラウズで別の検索エンジンを使用します。
ko: 개인정보 보호 브라우징으로 다른 검색 엔진을 사용합니다.
pt: Usar buscador diferente na Navegação Privada.
ru: Используйте различные поисковые машины в режиме частного доступа.
uk: Використовуйте іншу пошукову систему в приватному перегляді.
zh_hans: 在无痕浏览中使用其他搜索引擎。
zh_hant: 在「私密瀏覽」中使用其他搜尋引擎。

source: Valid data not found in JSON
ar: لم يتم العثور على بيانات صالحة في JSON
de: Gültige Daten in der JSON-Datei nicht gefunden
es: No se encontraron datos válidos en JSON
fr: Aucune donnée valide trouvée dans le JSON
ja: 有効なJSONデータが見つかりません
ko: 유효한 JSON 데이터를 찾을 수 없습니다
pt: Dados válidos não encontrados no JSON
ru: Допустимые данные не найдены в JSON
uk: У JSON не знайдено дійсних даних
zh_hans: 在 JSON 中未找到有效数据
zh_hant: 在 JSON 中未找到有效資料

source: Version
ar: الإصدار
es: Versión
ja: バージョン
ko: 버전
pt: Versão
ru: Версия
uk: Версія
zh_hans: 版本
zh_hant: 版本

source: Welcome to CSE
ar: مرحباً بك في CSE
de: Willkommen bei CSE
es: Bienvenido a CSE
fr: Bienvenue au CSE
ja: CSEへようこそ
ko: CSE에 오신 것을 환영합니다
pt: Bem-vindo ao CSE
ru: Добро пожаловать в CSE
uk: Ласкаво просимо до CSE
zh_hans: 欢迎来到 CSE
zh_hant: 歡迎來到 CSE

source: Yandex is currently unavailable.
ar: Yandex غير متوفر حالياً.
de: Yandex ist derzeit nicht verfügbar.
es: Yandex no está disponible actualmente.
fr: Yandex est actuellement indisponible.
ja: Yandexは現在利用できません。
ko: Yandex는 현재 사용할 수 없습니다.
pt: O Yandex não está disponível no momento.
ru: Яндекс в настоящее время недоступен.
uk: Яндекс наразі недоступний.
zh_hans: Yandex 目前不可用。
zh_hant: Yandex 目前不可用。

source: You can find these settings in Settings → Apps → Safari.
ar: يمكنك العثور على هذه الإعدادات في الإعدادات ← التطبيقات ← سفاري.
de: Sie finden diese Einstellungen unter Einstellungen → Apps → Safari.
es: Encontrará estos ajustes en Configuración → Apps → Safari.
fr: Vous trouverez ces paramètres dans Réglages → Apps → Safari.
ja: 設定 → アプリ → Safariから設定を確認できます。
ko: 설정 → 앱 → Safari에서 설정을 확인할 수 있습니다.
pt: Você pode encontrar estas configurações em Ajustes → Apps → Safari.
ru: Эти настройки можно найти в разделе Настройки → Приложения → Safari.
uk: Ці налаштування можна знайти в розділі Параметри → Програми → Safari.
zh_hans: 您可以在设置 → App → Safari 浏览器中找到这些设置。
zh_hant: 您可以在「設定」→「App」→「Safari」中找到這些設定。

source: You will be able to change the application icon
ar: ستتمكن من تغيير أيقونة التطبيق
de: Sie können das Anwendungssymbol ändern
es: Podrás cambiar el ícono de la app
fr: Vous pourrez changer l'icône de l'application
ja: アプリのアイコンを変更できるようになります
ko: 앱 아이콘을 변경할 수 있습니다
pt: Você poderá alterar o ícone do aplicativo
ru: Вы сможете изменить значок приложения
uk: Ви зможете змінити значок застосунку
zh_hans: 可更改应用程序图标
zh_hant: 可更改應用程式圖標

source: Your purchase will support the development of CSE
ar: سيدعم شراؤك تطوير CSE
de: Mit Ihrem Kauf unterstützen Sie die Entwicklung von CSE
es: Su compra contribuirá al desarrollo de CSE
fr: Votre achat soutiendra le développement du CSE
ja: 購入することでCSEの開発をサポートできます。
ko: 구매를 통해 CSE의 개발을 지원할 수 있습니다
pt: Sua compra apoiará o desenvolvimento do CSE
ru: Ваша покупка будет способствовать развитию CSE
uk: Ваша покупка підтримає розробку CSE
zh_hans: 您可以通过购买以下产品来支持 CSE 的开发
zh_hant: 您可以透過購買以下產品來支持 CSE 的開發

source: Baidu
ja: バイドゥ
zh_hans: 百度
zh_hant: 百度

source: CSE will ignore all Focus Filters.
ja: CSEは全ての集中モードフィルタを無視するようになります。

source: CSE will not check that you have searched from the search bar.
ja: CSEは検索バーから検索したことを確認しなくなります。

source: Disable Auto Uploading to iCloud
ja: iCloudへの自動アップロードを停止

source: Disable Checker
ja: チェッカーを無効化

source: Enable Reset Buttons
ja: リセットボタンを有効化

source: Existing data will be deleted at next startup: %@
ja: 次の起動時に既存のデータが削除されます: %@

source: Ignore Focus Filter
ja: 集中モードフィルタを無視

source: Ignore POST Fallback
ja: POSTフォールバックを無視

source: Redo First Tutorial
ja: 最初のチュートリアルをやり直す

source: Reset All Custom Search Engines
ja: 全てのカスタム検索エンジンをリセット

source: Reset Default Search Engine
ja: デフォルトの検索エンジンをリセット

source: Reset Private Search Engine
ja: プライベート検索エンジンをリセット

source: Reset Quick Search Engines
ja: クイック検索エンジンをリセット

source: Sogou
ja: 捜狗
zh_hans: 搜狗
zh_hant: 搜狗

source: When using custom search engines with POST, to bypass CSP restrictions, the process redirects to a page created by CSE and then redirects again to your custom search engine. However, this mechanism does not work correctly in some environments (as far as I have researched, macOS). Enabling this setting will redirect directly to your custom search engine without bypassing CSP restrictions. However, for some Safari search engines with strict CSP settings (as far as I have researched, DuckDuckGo), it will not be possible to use a search engine with POST.
ja: カスタム検索エンジンでPOSTを使用する場合、CSPの制限を回避するために、一度CSEが作成したページにリダイレクトされ、再度カスタム検索エンジンにリダイレクトされます。ただし、この仕組みは一部の環境(私が調べた限りではmacOS)では正しく動作しません。この設定を有効にすると、CSPの制限を回避することなく、カスタム検索エンジンに直接リダイレクトされます。ただし、CSPの設定が厳しい一部のSafariの検索エンジン(私が調べた限りではDuckDuckGo)では、POSTを使った検索エンジンが利用できなくなります。

source: Yandex
ru: Яндекс
uk: Яндекс

source: 360 Search
zh_hans: 360搜索
zh_hant: 360搜索

source: Bing
zh_hans: 必应

source: Cizzuk
zh_hans: 雫(Cizzuk)

source: Google
zh_hans: 谷歌

source: Yahoo
zh_hans: 雅虎
